In [1]:
# Loopin through list

In [15]:
magicians = ['alice','david','carolina']

In [16]:
print(magicians)

['alice', 'david', 'carolina']

In [17]:
#Loop

In [37]:
for magician in magicians:
    print(magician)

alice
david
carolina

In [46]:
for magician in magicians:
    print(f"{magician.title()}, that was a great trick!")
    print(f"I can't wait to see your next trick, {magician.title()}")

Alice, that was a great trick!
I can't wait to see your next trick, Alice
David, that was a great trick!
I can't wait to see your next trick, David
Carolina, that was a great trick!
I can't wait to see your next trick, Carolina

In [47]:
for magician in magicians:
    print(f"{magician.title()}, that was a great trick!")
for magician in magicians:
    print(f"I can't wait to see your next trick, {magician.title()}")

Alice, that was a great trick!
David, that was a great trick!
Carolina, that was a great trick!
I can't wait to see your next trick, Alice
I can't wait to see your next trick, David
I can't wait to see your next trick, Carolina

In [48]:
for magician in magicians:
    print(f"{magician.title()}, that was a great trick!")
    print(f"I can't wait to see your next trick, {magician.title()}")
print("Thank you, everyone.")

Alice, that was a great trick!
I can't wait to see your next trick, Alice
David, that was a great trick!
I can't wait to see your next trick, David
Carolina, that was a great trick!
I can't wait to see your next trick, Carolina
Thank you, everyone.

In [52]:
for value in range(1,5):
    print(value)

1
2
3
4

In [53]:
for value in range(6):
    print(value)

0
1
2
3
4
5

In [56]:
numbers = list(range(1,6))
print(numbers)

[1, 2, 3, 4, 5]

In [57]:
even_numbers = list(range(2,11,2))
print(even_numbers)

[2, 4, 6, 8, 10]

In [60]:
squares=[]
for value in range(1,11):
    square = value ** 2
    squares.append(square)
print(squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [61]:
#Alternative
squares=[]
for value in range(1,11):
    squares.append(value**2)
print(squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [68]:
sum(squares)

385

In [71]:
#List comprehension
squares=[value**2 for value in range(1,11)]
print(squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [82]:
labbies=['Nick','Mehrsa','Tim','Dominique']
print(labbies[2:])

['Tim', 'Dominique']

In [85]:
print(labbies[::2])

['Nick', 'Tim']

In [86]:
print("Here are the first three lab members:")
for member in labbies[:3]:
    print(member.title())

Here are the first three lab members:
Nick
Mehrsa
Tim

In [93]:
#Copy list
labbies2=labbies[:]
print(labbies)
print(labbies2)

['Nick', 'Mehrsa', 'Tim', 'Dominique']
['Nick', 'Mehrsa', 'Tim', 'Dominique']

In [94]:
labbies2.append('Jesse')
print(labbies2)

['Nick', 'Mehrsa', 'Tim', 'Dominique', 'Jesse']

In [95]:
#Tuples use parantheses instead of square brackets
dimensions=(200,50)
print(dimensions[0])
print(dimensions[1])

200
50

In [96]:
dimensions[1]=250

TypeError: 'tuple' object does not support item assignment

In [97]:
dimensions.append(250)

AttributeError: 'tuple' object has no attribute 'append'

In [1]:
# Funcitons

In [4]:
def greet_user(username):
    print(f"Hello, {username.title()}!")
greet_user('Jesse')

Hello, Jesse!

In [5]:
#Positional arguments
def pet_info(pet_type, pet_name):
    print(f"I have a {pet_type.title()}")
    print(f"My {pet_type.title()}'s name is {pet_name.title()}.")
pet_info('dog','Black Jack')

I have a Dog
My Dog's name is Black Jack

In [6]:
#Keyword arguments
def pet_info(pet_type, pet_name):
    print(f"I have a {pet_type.title()}")
    print(f"My {pet_type.title()}'s name is {pet_name.title()}.")
pet_info(pet_name='Black Jack',pet_type='dog')

I have a Dog
My Dog's name is Black Jack.

In [8]:
#Default values
def pet_info(pet_name, pet_type='Dog'):
    print(f"I have a {pet_type.title()}")
    print(f"My {pet_type.title()}'s name is {pet_name.title()}.")
pet_info(pet_name='Black Jack')

I have a Dog
My Dog's name is Black Jack.

In [9]:
#Default values
def pet_info(pet_name, pet_type='Dog'):
    print(f"I have a {pet_type.title()}")
    print(f"My {pet_type.title()}'s name is {pet_name.title()}.")
pet_info(pet_name='Nala',pet_type='Cat')

I have a Cat
My Cat's name is Nala.

In [16]:
#Optional Argument
def get_formatted_name(first_name, last_name, middle_name=""):
    if middle_name:
        full_name=f"{first_name}{middle_name} {last_name}"
    else:
        full_name = f"{first_name} {last_name}"
    return full_name.title()
musician = get_formatted_name('jimi', 'hendrix')
print(musician)

Jimi Hendrix

In [19]:
def get_formatted_name(first_name, last_name, middle_name=""):
    if middle_name:
        full_name=f"{first_name}{middle_name} {last_name}"
    else:
        full_name = f"{first_name} {last_name}"
    return full_name.title()
musician = get_formatted_name('Jimi','Michael', 'Hendrix')
print(musician)

Jimihendrix Michael

In [28]:
#Function with while loop
def get_formatted_name(first_name, last_name):
       """Return a full name, neatly formatted."""
       full_name = f"{first_name} {last_name}"
       return full_name.title()

   # This is an infinite loop!
while True:
        print("\nPlease tell me your name:")
        f_name = input("First name: ")
        l_name = input("Last name: ")

        formatted_name = get_formatted_name(f_name, l_name)
        print(f"\nHello, {formatted_name}!")

Please tell me your name:

First name:  Tim
Last name:  Jonas

Hello, Tim Jonas!

Please tell me your name:

KeyboardInterrupt:

In [29]:
# Start with some designs that need to be printed.
unprinted_designs = ['phone case', 'robot pendant', 'dodecahedron']
completed_models = []

# Simulate printing each design, until none are left.
#  Move each design to completed_models after printing.
while unprinted_designs:
    current_design = unprinted_designs.pop()
    print(f"Printing model: {current_design}")
    completed_models.append(current_design)

# Display all completed models.
print("\nThe following models have been printed:")
for completed_model in completed_models:
    print(completed_model)

Printing model: dodecahedron
Printing model: robot pendant
Printing model: phone case

The following models have been printed:
dodecahedron
robot pendant
phone case

In [33]:
class MyClass:
    variable='Test'
    def function(sample):
        print("This is a test for objects and classes")
mytestobject = MyClass()
mytestobject.variable

'Test'

In [34]:
# define the Vehicle class
class Vehicle:
    name = ""
    kind = "car"
    color = ""
    value = 100.00
    def description(self):
        desc_str = "%s is a %s %s worth $%.2f." % (self.name, self.color, self.kind, self.value)
        return desc_str
# your code goes here
car1 = Vehicle()
car1.name="Fer"
car1.kind="convertible"
car1.color="red"
car1.value=60000
car2=Vehicle()
car2.name="Jump"
car2.kind="van"
car2.color="blue"
car2.value=10000
# test code
print(car1.description())
print(car2.description())

Fer is a red convertible worth $60000.00.
Jump is a blue van worth $10000.00.

In [35]:
#Dictionaries
phonebook = {}
phonebook["John"] = 938477566
phonebook["Jack"] = 938377264
phonebook["Jill"] = 947662781
print(phonebook)

{'John': 938477566, 'Jack': 938377264, 'Jill': 947662781}

In [36]:
#Alternative way for dictionaries
phonebook = {
    "John" : 938477566,
    "Jack" : 938377264,
    "Jill" : 947662781
}
print(phonebook)

{'John': 938477566, 'Jack': 938377264, 'Jill': 947662781}

In [37]:
#Iterating over dictionaries
phonebook = {"John" : 938477566,"Jack" : 938377264,"Jill" : 947662781}
for name, number in phonebook.items():
    print("Phone number of %s is %d" % (name, number))

Phone number of John is 938477566
Phone number of Jack is 938377264
Phone number of Jill is 947662781

In [39]:
#Deleting entries
del phonebook["Jack"]
print(phonebook)

{'John': 938477566, 'Jill': 947662781}

In [41]:
#Deleting entry
phonebook.pop("John")
print(phonebook)

{'Jill': 947662781}

In [44]:
#Add "Jake" to the phonebook with the phone number 938273443, and remove Jill from the phonebook.

phonebook = {
    "John" : 938477566,
    "Jack" : 938377264,
    "Jill" : 947662781
}

# write your code here
phonebook.update({"Jake" : 938282})
phonebook.pop("Jill")
# testing code
if "Jake" in phonebook:
    print("Jake is listed in the phonebook.")
if "Jill" not in phonebook:
    print("Jill is not listed in the phonebook.")

Jake is listed in the phonebook.
Jill is not listed in the phonebook.

In [46]:
#In this exercise, you will need to print an alphabetically sorted list of all functions in the re module, which contain the word find.
#Solution
import re

# Your code goes here
find_members = []
for member in dir(re):
    if "find" in member:
        find_members.append(member)

print(sorted(find_members))

['findall', 'finditer']

In [3]:
#Pandas
#Designed for working with tabular or heterogeneous data

import pandas as pd

In [6]:
from pandas import Series, DataFrame

In [7]:
#There are Series and Data Frames 
#Series is a one dimensional array-like object containing a sequence of values and an associated array of data labels, called its index

In [8]:
obj=pd.Series([4,7,-5,3])
obj
#Index on the left, values on the right

0    4
1    7
2   -5
3    3
dtype: int64

In [11]:
#Identifying each point with a label
obj2=pd.Series([4,7,-5,3], index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2['a']

-5

In [17]:
obj2[['c','d']]

c    3
d    4
dtype: int64

In [18]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [19]:
'b' in obj2

True

In [20]:
'x' in obj2

False

In [26]:
#Creating a Series from a Python Dict
sdata={'Ohio':3500,'Texas':2000,'Rhode Island':500}
obj3=pd.Series(sdata)
obj3

Ohio            3500
Texas           2000
Rhode Island     500
dtype: int64

In [27]:
states=['California','Ohio','Texas','Rhode Island']
obj4=pd.Series(sdata,index=states)
obj4

California         NaN
Ohio            3500.0
Texas           2000.0
Rhode Island     500.0
dtype: float64

In [28]:
pd.isnull(obj4)

California       True
Ohio            False
Texas           False
Rhode Island    False
dtype: bool

In [29]:
pd.notnull(obj4)

California      False
Ohio             True
Texas            True
Rhode Island     True
dtype: bool

In [30]:
#Series automatically aligns by index label in arithmetric operatios
obj3+obj4

California         NaN
Ohio            7000.0
Rhode Island    1000.0
Texas           4000.0
dtype: float64

In [33]:
#Both, the series object itself and its index have a name attribute
obj4.name='population'
obj4.index.name='state'
obj4

state
California         NaN
Ohio            3500.0
Texas           2000.0
Rhode Island     500.0
Name: population, dtype: float64

In [35]:
#Change index
obj.index=['Bob','Charles','Donald','Peter']
obj

Bob        4
Charles    7
Donald    -5
Peter      3
dtype: int64

In [36]:
#DataFrame
#Represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different type (numeric, string, boolean,etc.)
#Has both, row and column index
#Many ways to construct it, one of them is from a dict of equal-length lists

In [38]:
dataf={'state':['Ohio','Rhode Island','Nevada'],
      'year':[2000,2001,2005],
      'pop':[2000,500,1000]}
frame=pd.DataFrame(dataf)
frame

          state  year   pop
0          Ohio  2000  2000
1  Rhode Island  2001   500
2        Nevada  2005  1000

In [39]:
#head method only selects the first five rows
frame.head()

          state  year   pop
0          Ohio  2000  2000
1  Rhode Island  2001   500
2        Nevada  2005  1000

In [41]:
#If you specify a sequence of columns, the DataFrame's columns will be presented in that order
pd.DataFrame(dataf,columns=['pop','year','state'])

    pop  year         state
0  2000  2000          Ohio
1   500  2001  Rhode Island
2  1000  2005        Nevada

In [43]:
frame.loc[2]

state    Nevada
year       2005
pop        1000
Name: 2, dtype: object

In [44]:
frame['debt']=16.5
frame

          state  year   pop  debt
0          Ohio  2000  2000  16.5
1  Rhode Island  2001   500  16.5
2        Nevada  2005  1000  16.5

In [53]:
#Another form is a nested dict of dicts
pop={'Nevada':{2001: 1.4, 2002: 2.4}, 'Ohio':{2000: 1.5, 2002: 1.7, 2001: 3.6}}

In [54]:
frame2=pd.DataFrame(pop)
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     1.4   3.6
2002     2.4   1.7

In [55]:
#transpose Data Frames
frame2.T

        2000  2001  2002
Nevada   NaN   1.4   2.4
Ohio     1.5   3.6   1.7

In [56]:
#Inner dicts are combined and sorted to form the index in the results (see above). This isn't true if an explicit index is specified
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     1.4   3.6
2002     2.4   1.7
2003     NaN   NaN

In [59]:
#If names are assigned, these will be displayed
frame2.index.name = 'year'; frame2.columns.name = 'state'
frame2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      1.4   3.6
2002      2.4   1.7

In [60]:
frame2.values

array([[nan, 1.5],
       [1.4, 3.6],
       [2.4, 1.7]])

In [68]:
#Reindexing:  create new object with the data conformed to a new index
obj = pd.Series([4.5,6.3,-5.7,2.6], index=['d','b','a','c'])
print(obj)
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

d    4.5
b    6.3
a   -5.7
c    2.6
dtype: float64

a   -5.7
b    6.3
c    2.6
d    4.5
e    NaN
dtype: float64

In [70]:
#For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing
#ffill, which forward-fills the values
obj3=pd.Series(['blue', 'purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [71]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [77]:
#Wirth DataFrame, reindex can either alter the (row) index, columns or both
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                   index=['a','c','d'],
                   columns=['Ohio','Texas','California'])
frame
frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [78]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [79]:
#Dropping Entries from an Axis
obj=pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [83]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [86]:
obj.drop(['e','c'])

a    0.0
b    1.0
d    3.0
dtype: float64

In [89]:
#Create Data Frame
data=pd.DataFrame(np.arange(16).reshape((4,4)), 
                  index=['Ohio','Colorado', 'Utah', 'New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [90]:
#Drop Values from row labels
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
#drop values from columns by passing axis=1 or axis= 'columns'
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [92]:
data.drop(['two','four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [98]:
#inplace modifies Series or DataFrame without creating new object --> Be careful!
obj.drop('d', inplace=True)
obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [101]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [102]:
obj['b']

1.0

In [104]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [105]:
obj[1]

1.0

In [107]:
obj[['a','b']]

a    0.0
b    1.0
dtype: float64

In [108]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [111]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [112]:
obj['b':'c']=5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [114]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio', 'New York', 'Utah', 'Rhode Island'],
                 columns=['one', 'two', 'three', 'four'])
data

              one  two  three  four
Ohio            0    1      2     3
New York        4    5      6     7
Utah            8    9     10    11
Rhode Island   12   13     14    15

In [115]:
data['two']

Ohio             1
New York         5
Utah             9
Rhode Island    13
Name: two, dtype: int64

In [120]:
data[['three','one']]

              three  one
Ohio              2    0
New York          6    4
Utah             10    8
Rhode Island     14   12

In [126]:
#Indexing like this has a few special cases
data[:2]

          one  two  three  four
Ohio        0    1      2     3
New York    4    5      6     7

In [127]:
data[data['three']>5]

              one  two  three  four
New York        4    5      6     7
Utah            8    9     10    11
Rhode Island   12   13     14    15

In [128]:
data<5

                one    two  three   four
Ohio           True   True   True   True
New York       True  False  False  False
Utah          False  False  False  False
Rhode Island  False  False  False  False

In [130]:
data[data<5]=0
data

              one  two  three  four
Ohio            0    0      0     0
New York        0    5      6     7
Utah            8    9     10    11
Rhode Island   12   13     14    15

In [134]:
#Selection with LOC and ILOC
#Enable you to select a subset of the rows and columns from a DataFrame with NumPy alike notation using either axis lable (loc) or integers (iloc)
data.loc['Ohio', ['two','three']]

two      0
three    0
Name: Ohio, dtype: int64

In [135]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [136]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [137]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
New York     7    0    5
Utah        11    8    9

In [138]:
#Both indexing funcitons work with slices in addition to single labels or lists of labels
data.loc[:'Utah','two']

Ohio        0
New York    5
Utah        9
Name: two, dtype: int64

In [147]:
data.iloc[:,:3][data.three>5]

              one  two  three
New York        0    5      6
Utah            8    9     10
Rhode Island   12   13     14

In [148]:
#Integer Indexes
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [149]:
ser[-1]

KeyError: -1

In [154]:
#With non-integer index, there is no problem
ser2=pd.Series(np.arange(3.), index=['a','b','c'])
ser2[-1]

2.0

In [156]:
#Arithmetic and Data Allignment
s1=pd.Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])
s2=pd.Series([-2.1,3.6,-1.5,4,3.1], index=['a','c','e','f','g'])
s1
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [157]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [158]:
#Arithmetic Methods with fill values
s1.add(s2,fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

In [159]:
1/s1

a    0.136986
c   -0.400000
d    0.294118
e    0.666667
dtype: float64

In [160]:
#is equal to
s1.rdiv(1)

a    0.136986
c   -0.400000
d    0.294118
e    0.666667
dtype: float64

In [161]:
#Function application and Mapping
frame=pd.DataFrame(np.random.randn(4,3), index=['Utah', 'Ohio', 'Texas','Oregon'])
frame

               0         1         2
Utah    1.882550 -0.342570  1.570690
Ohio    1.556779  0.685120  0.524901
Texas   0.287832 -0.025644 -0.044638
Oregon  0.296566  0.240054 -1.653983

In [164]:
np.abs(frame)

               0         1         2
Utah    1.882550  0.342570  1.570690
Ohio    1.556779  0.685120  0.524901
Texas   0.287832  0.025644  0.044638
Oregon  0.296566  0.240054  1.653983

In [177]:
f=lambda x: x.max()-x.min()
frame.apply(f)

0    1.594718
1    1.027690
2    3.224673
dtype: float64

In [168]:
frame.apply(f, axis='columns')

Utah      2.225121
Ohio      1.031879
Texas     0.332470
Oregon    1.950549
dtype: float64

In [175]:
np.mean(np.abs(frame), axis='columns')

Utah      1.265270
Ohio      0.922267
Texas     0.119371
Oregon    0.730201
dtype: float64

In [180]:
#Sorting and Ranking
obj=pd.Series(range(4), index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [195]:
#With a DataFrame you can sort by index on either axis
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                      index=['three','one'],
                     columns=['d','a','b','c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [196]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [197]:
#Descending order
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [202]:
#Sort a Series by values
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [203]:
#Missing values are sorted add the end by default
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [204]:
obj.sort_values(ascending=False)

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [205]:
#Sort Data Frames by values
frame.sort_values(by='b')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [207]:
#Sort by multiple columns
frame.sort_index(by=['b','a'])

//anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [209]:
#Assign ranks
obj=pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [211]:
#Rank by order in which they are observed in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [212]:
#Axis indexes with duplicate labels
obj=pd.Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [214]:
obj.index.is_unique

False

In [215]:
obj['a']

a    0
a    1
dtype: int64

In [216]:
obj['c']

4

In [217]:
#Summarizing and Computing Descriptive Statistics
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
               index=['a','b','c','c'],
               columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
c  0.75 -1.3

In [218]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [220]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
c   -0.55
dtype: float64

In [221]:
#NA values are excluded unless entire slice is na. This can be disabled with skipna option
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
c   -0.275
dtype: float64

In [222]:
#idxmin and idxmax show index value that contains minimum and maximum
df.idxmin()

one    c
two    b
dtype: object

In [224]:
df.idxmax()

one    b
two    c
dtype: object

In [225]:
#Accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
c  9.25 -5.8

In [226]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [233]:
#Descriptive statistics with non-numeric data is alternative
obj=pd.Series(['a','a','b','c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [8]:
import pandas as pd
import pandas_datareader as web

In [9]:
#Download some data from stock tickers
all_data = {ticker: web.get_data_yahoo(ticker)
    for ticker in ['AAPL','IBM','MSFT','GOOG']}
price = pd.DataFrame({ticker:data ['Adj Close']
                    for ticker, data in all_data.items()})
volume=pd.DataFrame({ticker:data['Volume']
                    for ticker, data in all_data.items()})

In [10]:
#Calculate percent changes
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-10-14 -0.001439 -0.005043 -0.000931  0.001390
2019-10-15 -0.002332  0.006759  0.014475  0.021255
2019-10-16 -0.004037 -0.006224 -0.008194  0.000507
2019-10-17  0.003883 -0.055239 -0.005128  0.007583
2019-10-18  0.004803 -0.001266 -0.016322 -0.006049

In [11]:
#corr method for correlation between two series
returns['MSFT'].corr(returns['IBM'])

0.48745166009643404

In [12]:
#Correlation for all of them
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.406377  0.572505  0.521228
IBM   0.406377  1.000000  0.487452  0.412574
MSFT  0.572505  0.487452  1.000000  0.653746
GOOG  0.521228  0.412574  0.653746  1.000000

In [14]:
#Corrwith to compute pairwise correlations between DataFram' columns or rows
returns.corrwith(returns.IBM)

AAPL    0.406377
IBM     1.000000
MSFT    0.487452
GOOG    0.412574
dtype: float64

In [16]:
returns.corrwith(volume)

AAPL   -0.114760
IBM    -0.131338
MSFT   -0.082346
GOOG   -0.006528
dtype: float64

In [18]:
volume

                  AAPL         IBM        MSFT       GOOG
Date
2014-10-21  94623900.0  20949800.0  36433800.0  2336200.0
2014-10-22  68263100.0  11084800.0  33570900.0  2919200.0
2014-10-23  71074700.0   7599400.0  45451900.0  2348800.0
2014-10-24  47053900.0   6652100.0  61076700.0  1973100.0
2014-10-27  34187700.0   4989100.0  30371300.0  1185300.0
2014-10-28  48060900.0   7895300.0  29049800.0  1270900.0
2014-10-29  52687900.0   4739300.0  30276100.0  1770500.0
2014-10-30  40654800.0   3896000.0  30073900.0  1455600.0
2014-10-31  44639300.0   5818000.0  35849700.0  2035000.0
2014-11-03  52282600.0   4688200.0  23130400.0  1382200.0
2014-11-04  41574400.0   4246900.0  21530800.0  1244200.0
2014-11-05  37435900.0   4104700.0  22449600.0  2032200.0
2014-11-06  34968500.0   4067600.0  33037800.0  1333200.0
2014-11-07  33691500.0   3494800.0  28000600.0  1633700.0
2014-11-10  27195500.0   4958200.0  36370100.0  1134600.0
2014-11-11  27442300.0   3534400.0  23445200.0   965500.0
2014-11-12  46942400.0   3378200.0  22722100.0  1129600.0
2014-11-13  59522900.0   3239700.0  26210400.0  1339300.0
2014-11-14  44063600.0   4978400.0  29081700.0  1289500.0
2014-11-17  46746700.0   4798900.0  30318600.0  1726000.0
2014-11-18  44224000.0   5410100.0  23995500.0  1962600.0
2014-11-19  41869200.0   3802600.0  26177500.0  1392200.0
2014-11-20  43395500.0   4183100.0  21510600.0  1563300.0
2014-11-21  57179300.0   4076900.0  42884800.0  2224200.0
2014-11-24  47450800.0   6619000.0  35434200.0  1706300.0
2014-11-25  68840400.0   4062400.0  28008000.0  1789900.0
2014-11-26  40768300.0   3966000.0  27163600.0  1522900.0
2014-11-28  24814400.0   2405500.0  21534400.0  1148300.0
2014-12-01  83814000.0   4168400.0  31191600.0  2115300.0
2014-12-02  59348900.0   3465700.0  25773500.0  1526600.0
...                ...         ...         ...        ...
2019-09-09  27309400.0   4226600.0  25773900.0  1471900.0
2019-09-10  31777900.0   4979700.0  28903400.0  1260100.0
2019-09-11  44289600.0   3869700.0  24726100.0  1307000.0
2019-09-12  32226700.0   2505400.0  27010000.0  1725900.0
2019-09-13  39763300.0   2206600.0  23363100.0  1301400.0
2019-09-16  21158100.0   1928500.0  16731400.0  1053300.0
2019-09-17  18318700.0   2933200.0  17814200.0   955100.0
2019-09-18  25340000.0   1983600.0  23982100.0  1135100.0
2019-09-19  22060600.0   3089900.0  35772100.0   996000.0
2019-09-20  55413100.0   5193400.0  39167300.0  2270000.0
2019-09-23  19165500.0   1817900.0  17139300.0  1062400.0
2019-09-24  31190800.0   3231600.0  29773200.0  1583200.0
2019-09-25  21903400.0   2526700.0  21382000.0  1453000.0
2019-09-26  18833500.0   2309800.0  17456600.0  1538000.0
2019-09-27  25352000.0   2356800.0  22477700.0  1353900.0
2019-09-30  25977400.0   3988400.0  17280900.0  1404100.0
2019-10-01  34805800.0   2960800.0  21466600.0  1273500.0
2019-10-02  34612300.0   3340800.0  30521700.0  1615100.0
2019-10-03  28606500.0   2928800.0  24132900.0  1621200.0
2019-10-04  34619700.0   2413600.0  22897700.0  1162400.0
2019-10-07  30576500.0   2426500.0  15303700.0   842900.0
2019-10-08  27955000.0   3225400.0  25550500.0  1039300.0
2019-10-09  18692600.0   2620800.0  19749900.0   867700.0
2019-10-10  28253400.0   2593700.0  17654600.0   846600.0
2019-10-11  41698900.0   2996800.0  25446000.0  1272700.0
2019-10-14  24106900.0   2309500.0  13304300.0   867500.0
2019-10-15  21840000.0   3025500.0  19695700.0  1381700.0
2019-10-16  18475800.0   5332600.0  20751600.0  1094600.0
2019-10-17  16896300.0  15759800.0  21460600.0   952400.0
2019-10-18  24358400.0   7177500.0  32273500.0  1352800.0

[1258 rows x 4 columns]

In [19]:
all_data = {ticker: web.get_data_yahoo(ticker)
    for ticker in ['DAI.DE','VNA.DE','MSFT','GOOG']}
price = pd.DataFrame({ticker:data ['Adj Close']
                    for ticker, data in all_data.items()})
volume=pd.DataFrame({ticker:data['Volume']
                    for ticker, data in all_data.items()})

In [20]:
price

               DAI.DE     VNA.DE        MSFT         GOOG
Date
2014-10-21  46.368027  16.100157   40.175110   525.098328
2014-10-22  46.703972  16.132355   39.727531   531.251465
2014-10-23  47.172729  16.153881   40.300430   542.490601
2014-10-24  47.016479  16.100157   41.294075   538.302063
2014-10-27  46.477406  15.885353   41.097130   539.289368
2014-10-28  47.188358  15.928312   41.616329   547.397095
2014-10-29  47.266483  15.971272   41.732697   547.825928
2014-10-30  47.352421  16.200426   41.222458   548.803284
2014-10-31  48.461815  16.519003   42.028111   557.549255
2014-11-03  48.250874  16.830492   42.466732   553.699829
2014-11-04  47.782112  17.184940   42.583115   552.592834
2014-11-05  48.829006  17.349607   42.842709   544.425293
2014-11-06  49.196205  17.399742   43.594646   540.555908
2014-11-07  48.719635  17.901009   43.576752   539.528748
2014-11-10  49.118076  17.915272   43.764729   545.990967
2014-11-11  48.758694  17.829353   43.746830   548.783325
2014-11-12  47.657112  17.686207   43.666264   545.811462
2014-11-13  47.782112  17.764954   44.409256   543.886780
2014-11-14  47.750866  17.858049   44.382393   542.909424
2014-11-17  47.938370  17.893839   44.274975   535.041016
2014-11-18  48.868073  17.868727   43.905632   533.565125
2014-11-19  49.016518  17.782801   43.437222   535.519714
2014-11-20  49.149330  17.757780   43.869606   533.365662
2014-11-21  50.438408  18.190973   43.221031   536.028320
2014-11-24  51.086857  18.437977   42.869705   537.793518
2014-11-25  51.727497  18.437977   42.761612   539.598511
2014-11-26  51.868130  18.480938   43.013840   538.890503
2014-11-27  52.430637  18.541836         NaN          NaN
2014-11-28  52.969711  18.541836   43.067890   540.346497
2014-12-01  53.110340  18.033482   43.797543   532.338440
...               ...        ...         ...          ...
2019-09-09  46.450001  42.200001  137.520004  1204.410034
2019-09-10  46.849998  42.230000  136.080002  1206.000000
2019-09-11  47.180000  42.270000  136.119995  1220.170044
2019-09-12  47.759998  42.220001  137.520004  1234.250000
2019-09-13  48.540001  42.180000  137.320007  1239.560059
2019-09-16  48.049999  42.020000  136.330002  1231.300049
2019-09-17  47.220001  43.099998  137.389999  1229.150024
2019-09-18  47.360001  43.630001  138.520004  1232.410034
2019-09-19  47.424999  44.049999  141.070007  1238.709961
2019-09-20  47.345001  44.150002  139.440002  1229.930054
2019-09-23  46.240002  44.150002  139.139999  1234.030029
2019-09-24  45.465000  44.630001  137.380005  1218.760010
2019-09-25  45.400002  44.750000  139.360001  1246.520020
2019-09-26  44.865002  46.000000  139.539993  1241.390015
2019-09-27  45.380001  46.230000  137.729996  1225.089966
2019-09-30  45.619999  46.549999  139.029999  1219.000000
2019-10-01  45.165001  46.240002  137.070007  1205.099976
2019-10-02  44.055000  46.080002  134.649994  1176.630005
2019-10-03        NaN        NaN  136.279999  1187.829956
2019-10-04  43.810001  46.869999  138.119995  1209.000000
2019-10-07  43.805000  47.340000  137.119995  1207.680054
2019-10-08  43.555000  47.160000  135.669998  1189.130005
2019-10-09  44.400002  47.500000  138.240005  1202.310059
2019-10-10  45.540001  46.810001  139.100006  1208.670044
2019-10-11  47.060001  46.509998  139.679993  1215.449951
2019-10-14  47.064999  46.560001  139.550003  1217.140015
2019-10-15  48.049999  47.700001  141.570007  1243.010010
2019-10-16  48.799999  47.730000  140.410004  1243.640015
2019-10-17  49.125000  48.209999  139.690002  1253.069946
2019-10-18  48.424999  48.000000  137.410004  1245.489990

[1290 rows x 4 columns]